_posts/2014-01-01-Interactive-quizzes-with-feedback-in-org-mode.html
---
title: Interactive quizzes with feedback in org-mode
date: 2014/01/01 12:58:23
updated: 2014/01/01 12:58:23
categories: org-mode
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. What is 2 + 4?</a></li>
<li><a href="#sec-2">2. Lets make a custom link for this</a></li>
<li><a href="#sec-3">3. Storing quiz answers and number of attempts</a></li>
<li><a href="#sec-4">4. Using inline tasks instead of headings</a></li>
<li><a href="#sec-5">5. Concluding thoughts</a></li>
</ul>
</div>
</div>

<p>
I have been exploring ways to facilitate learning and grading. One way I like is to provide quizzes inline with text
Here are some examples of "interactive" quizzes with feedback to the user in org-mode. The principle idea is to use a headline for the question, and use properties to hold the answer. The answers are coded into links that run lisp code to check if the link text matches the correct answer. The properties are folded, so you have to willfully cheat to look at the answer. For getting instant feedback, this isn't such an issue. These aren't for formal assessment, but for knowledge checkpoints in active learning.
</p>

<p>
Blog alert: The links may only work in the actual org-file in Emacs, they will not function in html.  
</p>

<p>
Here is an example in a subheading. These links play an amusing sound (crowd cheers for correct answer, a buzzer for a wrong answer). The sounds are stored locally with the file. This gives students immediate feedback on their answer. These might be incorporated into reading assignments.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is 2 + 4?</h2>
<div class="outline-text-2" id="text-1">
<p>
a) <pre>elisp:(if (string= "4" (org-entry-get (point) "CORRECT-ANSWER"))  (play-sound-file "sounds/99636__tomlija__small-crowd-yelling-yeah.wav" 0.91 nil) (play-sound-file "sounds/fail-buzzer-01.wav" 0.91 nil))</pre> 
</p>

<p>
b) <pre>elisp:(if (string= "6" (org-entry-get (point) "CORRECT-ANSWER"))  (play-sound-file "sounds/99636__tomlija__small-crowd-yelling-yeah.wav" 0.91 nil) (play-sound-file "sounds/fail-buzzer-01.wav" 0.91 nil))</pre> 
</p>

<p>
c) <pre>elisp:(if (string= "-2" (org-entry-get (point) "CORRECT-ANSWER"))  (play-sound-file "sounds/99636__tomlija__small-crowd-yelling-yeah.wav" 0.91 nil) (play-sound-file "sounds/fail-buzzer-01.wav" 0.91 nil))</pre> 
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Lets make a custom link for this</h2>
<div class="outline-text-2" id="text-2">
<p>
Hand coding the links isn't very convenient. Let us write an org-link function that is more convenient. This new function will also record the number of correct and incorrect attempts. You could hard code some sound into them, but I did not do that here.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-add-link-type 
 <span style="color: #228b22;">"ans"</span> 
 (<span style="color: #8b0000;">lambda</span> (path) 
   (<span style="color: #8b0000;">let*</span> ((correct-answer (org-entry-get (point) <span style="color: #228b22;">"CORRECT-ANSWER"</span>))
          (ncorrect (org-entry-get (point) <span style="color: #228b22;">"NUM-CORRECT"</span>))
          (num-correct (<span style="color: #8b0000;">if</span> ncorrect (string-to-number ncorrect) 0))
          (nincorrect (org-entry-get (point) <span style="color: #228b22;">"NUM-INCORRECT"</span>))
          (num-incorrect (<span style="color: #8b0000;">if</span> nincorrect (string-to-number nincorrect) 0)))
     (<span style="color: #8b0000;">if</span> (string= path correct-answer) 
         (<span style="color: #8b0000;">progn</span>
          (org-entry-put (point) <span style="color: #228b22;">"NUM-CORRECT"</span> (number-to-string (+ num-correct 1)))
          (message <span style="color: #228b22;">"correct"</span>))
       (org-entry-put (point) <span style="color: #228b22;">"NUM-INCORRECT"</span> (number-to-string (+ num-incorrect 1)))
       (message <span style="color: #228b22;">"incorrect"</span>)))))
</pre>
</div>

<p>
That function was a bit trickier than I thought it would be. First, I used let* because the first time you click on a link the correct answer counters may not exist, so getting the property would return nil. If it is nil, then we should initialize to 0. If it is not nil, we need to convert the string that is returned to an integer so we can add to it later. Then, we need to convert that integer back to a string to store it as a property, otherwise it is stored as some strange control character. 
</p>

<p>
Now, we can put our question in.
question: Is 3 greater than 2?
</p>

<p>
Here are the new links:  <pre>ans:yes</pre> <pre>ans:no</pre> 
</p>


<p>
That function goes along way to making it pretty easy to write the answers. One limitation here is that you can only put one question per section. We address that later. It is still easy to cheat if you want. We could do a few things to make that harder. One idea would be to encrypt the answers, and compare the hash of the answers. Another is to just record what was clicked on, and then grade it later. In the next section we try that out.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><a id="ID-fa6cc63f-e2da-47a7-9721-cb970dde335e" name="ID-fa6cc63f-e2da-47a7-9721-cb970dde335e"></a><span class="section-number-2">3</span> Storing quiz answers and number of attempts</h2>
<div class="outline-text-2" id="text-3">

<p>
Here, we store the answer, and number of attempts. Students won't get feedback from this approach, but they cannot cheat either. They could just type answers in to the org-file, but this approach is like a Scantron multiple choice exam that could be automatically graded later. You could use something like this as an electronic clicker to quickly assess everyone's understanding of some concepts.
</p>

<p>
Here is our new link function.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-add-link-type 
 <span style="color: #228b22;">"ans2"</span> 
 (<span style="color: #8b0000;">lambda</span> (path) 
   (org-entry-put (point) <span style="color: #228b22;">"ANSWER"</span> path)
   (<span style="color: #8b0000;">let*</span> ((nattempts (org-entry-get (point) <span style="color: #228b22;">"NUM-ATTEMPTS"</span>))
          (num-attempts (<span style="color: #8b0000;">if</span> nattempts (string-to-number nattempts) 0)))
     (org-entry-put (point) <span style="color: #228b22;">"NUM-ATTEMPTS"</span> (number-to-string (+ num-attempts 1))))
   (message <span style="color: #228b22;">"You selected %s for your answer"</span> path)))
</pre>
</div>

<p>
And now a question: Is 3 greater than 2?
<pre>ans2:yes</pre> <pre>ans2:no</pre> 
</p>

<p>
This way works very well. It might also be a good idea to give each question a unique id (org-id-get-create) so you can collect specific results. 
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Using inline tasks instead of headings</h2>
<div class="outline-text-2" id="text-4">
<p>
If you were integrating these into a book, it would be inconvenient to use headings because they would mess up the outline. We can use inline tasks instead.
</p>

<div class="inlinetask">
<b>Is 3 greater than 2?</b><br  />
<p>
<pre>ans2:yes</pre> <pre>ans2:no</pre> 
</p>
</div>

<p>
This adds some additional lines, but does not change the heading level. We can put multiple questions in then.
</p>

<div class="inlinetask">
<b>What is 4*4?</b><br  />
<p>
<pre>ans2:16</pre> <pre>ans2:18</pre> <pre>ans2:8</pre> 
</p>
</div>

<p>
Interesing, I noticed in this last example that a link path must have at least two characters to be automatically recognized by org-mode. I had to put double square brackets to make it a link!
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Concluding thoughts</h2>
<div class="outline-text-2" id="text-5">
<p>
This seems like a pretty promising approach to getting structured input from students. You would have to invest some time training them to use emacs and org-mode, and not modify the file in ways they are not supposed to.  You would also have to invest some time in writing analysis code to collect all the answers and analyze them somehow. I do not think that would be too hard though, and the payoff could be large. By giving students quick feedback they could have a better understanding of what they know, and might ask better questions. This could be a useful approach to active learning activities that students work on while reading.
</p>
</div>
</div>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/01/01/Interactive-quizzes-with-feedback-in-org-mode.org">org-mode source</a><p>